namespace $.$$ {
	/**
	 * 
	 * @extends $.$mws_app_spec
	 * @class $mws_app_spec
	 * @namespace $.$$
	 * @name $mws_app_spec
	 * @description В этом файле описывается поведение компонента $mws_app_spec. Можно переопределить свойства и методы компонента.
	 * @example
	 * ```typescript
	 * 
	 */
	export class $mws_app_spec extends $.$mws_app_spec {
		
		/**
		 * Переопределение свойства Name компонента $mws_app_spec.
		 * Декоратор $mol_mem - мемоизация свойства, свойство будет вычисляться только один раз и результат будет кэшироваться.
		 * Заивисмость создается при вызове любой функции с декоратором $mol_mem
		 * Его значение будет вычисляться только если свойство будет использоваться или зависимые свойства будут изменены.
		 * Зависимые свойства - это свойства, которые используются в вычисляемом свойстве.
		 * Например, если свойство name зависит от свойств firstName и lastName, то при изменении свойств firstName или lastName, свойство name будет пересчитываться.
		 * Если свойство name не будет использоваться, то его значение будет кэшироваться и не будет пересчитываться.
		 * @returns 
		 */
		@$mol_mem
		override Name(next?: string) { 
			return this.firstNameValue() + ' ' + this.lastNameValue()
		}

		/**
		 * Пример переопределения свойства firstNameValue компонента $mws_app_spec.
		 * Его устанавливает компонент $mol_string с помощью свойства value? <=> firstNameValue? null - двусторонняя связь.
		 * Свойство firstNameValue будет использоваться в свойстве Name.
		 * @param next 
		 * @returns значение свойства firstNameValue
		 */
		@$mol_mem
		firstNameValue(next?: string){
			return next ? next.trim() : ''
		}

		/**
		 * Пример переопределения метода save компонента $mws_app_spec.
		 * Метод будет вызываться при нажатии на кнопку Save.
		 * Метод будет отправлять данные на сервер.
		 * Декоратор $mol_action - при вызове таких функции - зависимость не создается внтури других $mol_mem функций
		 * Асинхронный код можно писать так же как и синхронный, при резолве функция выполняется снова - это работает, так как если выше по вызову есть $mol_mem функция, то она будет уже вычислена и сразу вернет результат.
		 * 
		 */
		@$mol_action
		save(){
			this.$.$mol_fetch.json('test.com', {
				method: 'POST',
				body: JSON.stringify({
					name: this.Name(),
				}),
			})
		}
		
	}
}
